{
    "Är det något du vill kommentera kring dina svar?": [
        {
            "theme_name": "Förbetalning",
            "theme_description": "Många användare uttrycker missnöje med att behöva betala i förskott för sina beställningar. De föredrar att betala i butik vid upphämtning, vilket de anser vara mer bekvämt och säkert. Detta upplevs som en försämring och skapar frustration.",
            "sentiment": "negative",
            "frequency": 5,
            "urgency": 5
        },
        {
            "theme_name": "Betalningsmetoder",
            "theme_description": "Användare efterfrågar fler betalningsalternativ, såsom Klarna, Apple Pay och Google Pay, samt möjligheten att spara betalkortsuppgifter för smidigare betalning. Vissa användare har också haft tekniska problem med betalningen.",
            "sentiment": "neutral",
            "frequency": 4,
            "urgency": 4
        },
        {
            "theme_name": "Tekniska problem",
            "theme_description": "Flera användare rapporterar tekniska problem med appen, särskilt vid betalning med Swish och BankID. Problem inkluderar att fastna på webbsidan efter betalning, att betalningen misslyckas, att appen hänger sig, och problem med autofyll för kortnummer. Detta påverkar användarupplevelsen negativt.",
            "sentiment": "negative",
            "frequency": 4,
            "urgency": 4
        },
        {
            "theme_name": "Användarvänlighet",
            "theme_description": "Användare har delade åsikter om appens användarvänlighet. Vissa tycker att den är smidig och enkel att använda, medan andra finner den rörig och svår att navigera, särskilt när det gäller att välja butik och genomföra betalningen.",
            "sentiment": "neutral",
            "frequency": 4,
            "urgency": 4
        },
        {
            "theme_name": "Beställningsfunktion",
            "theme_description": "Många användare uppskattar möjligheten att beställa via appen och tycker att det är en bra funktion. Dock finns det önskemål om att kunna beställa från specifika butiker och att få bättre information om tillgänglighet.",
            "sentiment": "positive",
            "frequency": 4,
            "urgency": 4
        },
        {
            "theme_name": "Presentkort",
            "theme_description": "Användare är missnöjda med att de inte kan använda presentkort vid beställning i appen. Detta var möjligt tidigare och upplevs nu som en stor nackdel.",
            "sentiment": "negative",
            "frequency": 2,
            "urgency": 2
        },
        {
            "theme_name": "Sökfunktion",
            "theme_description": "Sökfunktionen i appen får kritik för att ge dåliga resultat och inte hantera felstavningar väl. Användare önskar förbättringar för att göra det lättare att hitta produkter.",
            "sentiment": "negative",
            "frequency": 2,
            "urgency": 2
        },
        {
            "theme_name": "General",
            "theme_description": "Generellt sett är användarna missnöjda med förbetalningskravet och tekniska problem i appen. Det finns också önskemål om fler betalningsmetoder och förbättrad användarvänlighet. Trots vissa negativa aspekter uppskattar många användare möjligheten att beställa via appen.",
            "sentiment": "neutral",
            "frequency": 5,
            "urgency": 5
        }
    ]
}